# Задача 4: Петя, Катя и Сережа делают из бумаги журавликов. 
# Вместе они сделали S журавликов. Сколько журавликов сделал каждый ребенок, 
# если известно, что Петя и Сережа сделали одинаковое количество журавликов, 
# а Катя сделала в два раза больше журавликов, чем Петя и Сережа вместе?

n = int(input("Введите количество журавликов: "))
print ("Катя сделала", int (n*2/3))
print ("Петя сделал", int (n/6))
print ("Серёжа сделал", int (n/6))